c5/src/InformationRegisters/ID/ID.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ID</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>IssuedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Main</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Type</name>
    <type>
      <types>CatalogRef.IDTypes</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PaymentMethods</name>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>Check</name>
  </enumValues>
  <enumValues>
    <name>Visa</name>
  </enumValues>
  <enumValues>
    <name>Mastercard</name>
  </enumValues>
  <enumValues>
    <name>AmericanExpress</name>
  </enumValues>
  <enumValues>
    <name>EFT</name>
  </enumValues>
  <enumValues>
    <name>Bank</name>
  </enumValues>
  <enumValues>
    <name>PayPal</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReport</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/Operations/Operations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Operations</name>
  <enumValues>
    <name>AdditionalExpenses</name>
  </enumValues>
  <enumValues>
    <name>AdjustAdvances</name>
  </enumValues>
  <enumValues>
    <name>AdjustDebts</name>
  </enumValues>
  <enumValues>
    <name>AdjustVendorAdvances</name>
  </enumValues>
  <enumValues>
    <name>AdjustVendorDebts</name>
  </enumValues>
  <enumValues>
    <name>AdvanceApplied</name>
  </enumValues>
  <enumValues>
    <name>AdvanceGiven</name>
  </enumValues>
  <enumValues>
    <name>AdvanceTaken</name>
  </enumValues>
  <enumValues>
    <name>Assembling</name>
  </enumValues>
  <enumValues>
    <name>AutoWritingOffForm</name>
  </enumValues>
  <enumValues>
    <name>BankExpense</name>
  </enumValues>
  <enumValues>
    <name>BankReceipt</name>
  </enumValues>
  <enumValues>
    <name>CashExpense</name>
  </enumValues>
  <enumValues>
    <name>CashReceipt</name>
  </enumValues>
  <enumValues>
    <name>CustomerPayment</name>
  </enumValues>
  <enumValues>
    <name>CustomerRefund</name>
  </enumValues>
  <enumValues>
    <name>Disassembling</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReceipt</name>
  </enumValues>
  <enumValues>
    <name>FixedAssetsDepreciation</name>
  </enumValues>
  <enumValues>
    <name>FixedAssetsReceipt</name>
  </enumValues>
  <enumValues>
    <name>IncomeTaxWithheld</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssetsAmortization</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssetsReceipt</name>
  </enumValues>
  <enumValues>
    <name>Invoice</name>
  </enumValues>
  <enumValues>
    <name>ItemsCost</name>
  </enumValues>
  <enumValues>
    <name>ItemsReceipt</name>
  </enumValues>
  <enumValues>
    <name>ItemsRetirement</name>
  </enumValues>
  <enumValues>
    <name>ItemsReturn</name>
  </enumValues>
  <enumValues>
    <name>LVIExploitation</name>
  </enumValues>
  <enumValues>
    <name>LVITransfer</name>
  </enumValues>
  <enumValues>
    <name>LVIWriteOff</name>
  </enumValues>
  <enumValues>
    <name>NegativeCurrencyDifference</name>
  </enumValues>
  <enumValues>
    <name>OffsetVATImport</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherReceipt</name>
  </enumValues>
  <enumValues>
    <name>PaymentReturn</name>
  </enumValues>
  <enumValues>
    <name>PositiveCurrencyDifference</name>
  </enumValues>
  <enumValues>
    <name>ProductionOutput</name>
  </enumValues>
  <enumValues>
    <name>Sales</name>
  </enumValues>
  <enumValues>
    <name>SalesDiscount</name>
  </enumValues>
  <enumValues>
    <name>SalesTax</name>
  </enumValues>
  <enumValues>
    <name>Transfer</name>
  </enumValues>
  <enumValues>
    <name>VATAdvances</name>
  </enumValues>
  <enumValues>
    <name>VATAdvancesReverse</name>
  </enumValues>
  <enumValues>
    <name>VATDiscount</name>
  </enumValues>
  <enumValues>
    <name>VATPayable</name>
  </enumValues>
  <enumValues>
    <name>VATReceivable</name>
  </enumValues>
  <enumValues>
    <name>VendorPayment</name>
  </enumValues>
  <enumValues>
    <name>VendorRefund</name>
  </enumValues>
  <enumValues>
    <name>WriteoffCharges</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/CashVoucher/CashVoucher.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CashVoucher</name>
  <attributes>
    <name>Accountant</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.CashVoucherBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Director</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reason</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Documents/CashReceipt/CashReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CashReceipt</name>
  <attributes>
    <name>Accountant</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.CashReceiptBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Director</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>Giver</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reason</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Documents/Entry/Entry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Entry</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Simple</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Records</name>
    <attributes>
      <name>AccountCr</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountDr</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountCr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountDr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Content</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmountCr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmountDr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyCr</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyDr</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>FactorCr</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>FactorDr</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityCr</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityDr</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RateCr</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>RateDr</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/CommonModules/PettyCash/Module.bsl
&AtClient
Procedure Open ( Form, NotifyNew ) export
	
	if ( PettyCash.Voucher ( Form.Object.Ref ) ) then
		name = "CashVoucher";
		ref = Form.Voucher;
	else
		name = "CashReceipt";
		ref = Form.Receipt;
	endif; 
	params = new Structure ( "Form, NotifyNew, Reference", Form, NotifyNew, ref );
	callback = new NotifyDescription ( "PettyCashClosed", ThisObject, params );
	OpenForm ( "Document." + name + ".ObjectForm", new Structure ( "Key", ref ), Form, , , , callback );
	
EndProcedure 

Function Voucher ( Reference ) export
	
	type = TypeOf ( Reference );
	if ( type = Type ( "DocumentRef.CashVoucher" ) ) then
		return true;
	elsif ( type = Type ( "DocumentRef.CashReceipt" ) ) then
		return false;
	else
		return PettyCashSrv.Voucher ( Reference );
	endif;
	
EndFunction 

&AtClient
Procedure PettyCashClosed ( Result, Params ) export
	
	if ( Params.NotifyNew ) then
		Params.Form.NotifyWritingNew ( Params.Reference );
	endif; 
	
EndProcedure 

&AtServer
Procedure Read ( Form ) export
	
	reference = PettyCashSrv.Search ( Form.Object.Ref );
	if ( PettyCash.Voucher ( reference ) ) then
		Form.Voucher = reference;
	else
		Form.Receipt = reference;
	endif; 
	
EndProcedure 

&AtServer
Procedure NewReference ( Form ) export
	
	object = Form.Object;
	if ( object.Ref.IsEmpty () ) then
		Form.Write ();
	endif;
	field = ? ( PettyCash.Voucher ( object.Ref ), "Voucher", "Receipt" );
	if ( Form [ field ].IsEmpty () ) then
		update ( object, Form [ field ], Form.CopyOf );
	endif; 
	
EndProcedure 

&AtServer
Procedure update ( Object, Reference, CopyOf = undefined )
	
	disconnected = disconnect ( Object, Reference );
	isVoucher = PettyCash.Voucher ( Reference );
	if ( Reference.IsEmpty () ) then
		if ( disconnected ) then
			return;
		endif;
		if ( isVoucher ) then
			target = Documents.CashVoucher.CreateDocument ();
		else
			target = Documents.CashReceipt.CreateDocument ();
		endif;
		if ( ValueIsFilled ( CopyOf ) ) then
			copy ( Object, CopyOf, target );
		endif;
		isNew = true;
	else
		target = Reference.GetObject ();
		isNew = false;
	endif;
	target.Date = Object.Date;
	target.Company = Object.Company;
	target.Memo = Object.Memo;
	target.Posted = Object.Posted;
	deleted = disconnected or Object.DeletionMark;
	target.Disconnected = disconnected;
	target.DeletionMark = deleted;
	type = TypeOf ( Object.Ref );
	if ( type = Type ( "DocumentRef.Entry" ) ) then
		entry = entryData ( Object );
		target.Currency = entry.Currency;
		target.Amount = entry.Amount;
		target.Location = entry.Location;
		target.Reason = entry.Content;
	elsif ( type = Type ( "DocumentRef.PayEmployees" )
		or type = Type ( "DocumentRef.PayAdvances" ) ) then
		target.Currency = Application.Currency ();
		target.Amount = Object.Amount;
		target.Location = Object.Location;
	else
		target.Currency = Object.Currency;
		target.Location = Object.Location;
		if ( type = Type ( "DocumentRef.VendorPayment" ) ) then
			target.Amount = Object.Total;
		else
			target.Amount = Object.Amount;
		endif;
	endif; 
	if ( isNew ) then
		creator = Object.Creator;
		target.Creator = creator;
		target.Base = Object.Ref;
		target.Responsible = DF.Pick ( creator, "Employee.Individual" );
		data = Responsibility.Get ( Object.Date, Object.Company, "AccountantChief, GeneralManager" );
		target.Accountant = data.AccountantChief;
		target.Director = data.GeneralManager;
		if ( type = Type ( "DocumentRef.Payment" ) ) then
			target.Giver = presentation ( Object.Customer );
		elsif ( type = Type ( "DocumentRef.VendorRefund" ) ) then
			target.Giver = presentation ( Object.Vendor );
		elsif ( type = Type ( "DocumentRef.VendorPayment" ) ) then
			target.Receiver = presentation ( Object.Vendor );
		elsif ( type = Type ( "DocumentRef.Refund" ) ) then
			target.Receiver = presentation ( Object.Customer );
		elsif ( type = Type ( "DocumentRef.PayEmployees" )
			or type = Type ( "DocumentRef.PayAdvances" ) ) then
			target.Receiver = Object.Ref;
		elsif ( type = Type ( "DocumentRef.Entry" ) ) then
			subject = entry.Subject;
			name = presentation ( subject );
			if ( isVoucher ) then
				target.Receiver = name;
				target.ID = subjectID ( subject );
			else
				target.Giver = name;
			endif;
		endif; 
	endif; 
	markSyncing ( target );
	if ( deleted and target.Posted ) then
		target.Write ( DocumentWriteMode.UndoPosting );
		target.SetDeletionMark ( true );
	else
		target.Write ();
	endif;
	if ( isNew ) then
		Reference = target.Ref;
	endif; 
	
EndProcedure

&AtServer
Procedure copy ( Owner, CopyOf, Destination )
	
	source = PettyCashSrv.Search ( CopyOf ).GetObject ();
	FillPropertyValues ( Destination, source, , "Number" );

EndProcedure

&AtServer
Function disconnect ( Object, Reference )
	
	method = Object.Method;
	type = TypeOf ( Object.Ref );
	if ( type = Type ( "DocumentRef.Payment" )
		or type = Type ( "DocumentRef.Refund" )
		or type = Type ( "DocumentRef.VendorPayment" )
		or type = Type ( "DocumentRef.VendorRefund" )
		or type = Type ( "DocumentRef.PayEmployees" )
		or type = Type ( "DocumentRef.PayAdvances" ) ) then
		return method <> Enums.PaymentMethods.Cash;
	elsif ( type = Type ( "DocumentRef.Entry" ) ) then
		orderType = TypeOf ( Reference );
		if ( orderType = Type ( "DocumentRef.CashReceipt" ) ) then
			return method <> Enums.Operations.CashReceipt;
		elsif ( orderType = Type ( "DocumentRef.CashVoucher" ) ) then
			return method <> Enums.Operations.CashExpense;
		endif;
	endif;
	return false;

EndFunction

&AtServer
Function entryData ( Object )
	
	s = "
	|select
	|	case
	|		when Records.Ref.Method = value ( Enum.Operations.CashExpense )
	|			and Records.AccountCr.Currency then
	|			Records.CurrencyCr
	|		when Records.Ref.Method = value ( Enum.Operations.CashReceipt )
	|			and Records.AccountDr.Currency then
	|			Records.CurrencyDr
	|		else
	|			Constants.Currency
	|	end as Currency,
	|	case
	|		when Records.Ref.Method = value ( Enum.Operations.CashExpense ) then
	|			Records.DimCr1
	|		else
	|			Records.DimDr1
	|	end as Location,
	|	case
	|		when Records.Ref.Method = value ( Enum.Operations.CashExpense ) then
	|			Records.DimDr1
	|		else
	|			Records.DimCr1
	|	end as Subject,
	|	case
	|		when Records.Ref.Method = value ( Enum.Operations.CashExpense ) then
	|			case when Records.AccountCr.Currency then Total.CurrencyAmount else Total.Amount end
	|		else
	|			case when Records.AccountDr.Currency then Total.CurrencyAmount else Total.Amount end
	|	end as Amount,
	|	Records.Content as Content
	|from Document.Entry.Records as Records
	|	//
	|	// Totals
	|	//
	|	left join (
	|		select
	|			sum ( Records.Amount ) as Amount,
	|			sum ( isnull (
	|				case when Records.Ref.Method = value ( Enum.Operations.CashExpense ) then
	|					 	Records.CurrencyAmountCr
	|					else Records.CurrencyAmountDr
	|				end, 0 )
	|			) as CurrencyAmount
	|		from Document.Entry.Records as Records
	|		where Records.Ref = &Ref
	|	) as Total
	|	on true
	|	//
	|	// Constants
	|	//
	|	left join Constants
	|	on true
	|where Records.Ref = &Ref
	|and Records.LineNumber = 1
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Object.Ref );
	return Conversion.RowToStructure ( q.Execute ().Unload () );

EndFunction 

&AtServer
Function presentation ( Value )
	
	type = TypeOf ( Value );
	if ( type = Type ( "CatalogRef.Organizations" ) ) then
		data = DF.Values ( Value, "Individual, Description, FullDescription" );
		return ? ( data.Individual, data.Description, data.FullDescription );
	else
		return String ( Value );
	endif; 
	
EndFunction 

&AtServer
Function subjectID ( Subject )
	
	if ( TypeOf ( Subject ) <> Type ( "CatalogRef.Individuals" ) ) then
		return  "";
	endif; 
	data = identificationData ( Subject );
	if ( data = undefined ) then
		return "";
	endif; 
	parts = new Array ();
	value = data.Series;
	if ( value <> "" ) then
		parts.Add ( Output.IDSeries () + " " + value );
	endif; 
	value = data.Number;
	if ( value <> "" ) then
		parts.Add ( Output.IDNumber () + value );
	endif; 
	value = data.IssuedBy;
	if ( value <> "" ) then
		parts.Add ( Output.IDIssuedBy () + " " + value );
	endif; 
	value = data.Issued;
	if ( value <> Date ( 1, 1, 1 ) ) then
		parts.Add ( Output.IDIssued () + " " + Format ( value, "DLF=D" ) );
	endif; 
	s = StrConcat ( parts, ", " );
	value = data.Type;
	if ( value <> "" ) then
		s = "" + value + ": " + s;
	endif; 
	return Title ( s );
	
EndFunction 

&AtServer
Function identificationData ( Subject )
	
	s = "
	|select IDs.Type as Type, IDs.Series as Series, IDs.Number as Number,
	|	IDs.IssuedBy as IssuedBy, IDs.Issued as Issued
	|from InformationRegister.ID as IDs
	|where IDs.Individual = &Individual
	|and IDs.Main
	|";
	q = new Query ( s );
	q.SetParameter ( "Individual", Subject );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ] );
	
EndFunction 

&AtServer
Procedure Sync ( Object ) export
	
	var copy;
	if ( syncing ( Object ) ) then
		return;
	endif; 
	ref = Object.Ref;
	Object.AdditionalProperties.Property ( "CopyOf", copy );
	if ( TypeOf ( Object ) = Type  ( "DocumentObject.Entry" ) ) then
		method = Object.Method;
		voucher = Documents.CashVoucher.FindByAttribute ( "Base", ref );
		receipt = Documents.CashReceipt.FindByAttribute ( "Base", ref );
		if ( not voucher.IsEmpty ()
			or method = Enums.Operations.CashExpense ) then
			update ( Object, voucher, copy );
		endif;
		if ( not receipt.IsEmpty ()
			or method = Enums.Operations.CashReceipt ) then
			update ( Object, receipt, copy );
		endif;
	else
		update ( Object, PettyCashSrv.Search ( ref ), copy );
	endif;
	
EndProcedure 

&AtServer
Function syncing ( Object )
	
	sync = undefined;
	Object.AdditionalProperties.Property ( Enum.AdditionalPropertiesSyncing (), sync );
	return sync <> undefined
	and sync;
	
EndFunction 

&AtServer
Procedure markSyncing ( Object )
	
	Object.AdditionalProperties.Insert ( Enum.AdditionalPropertiesSyncing (), true );
	
EndProcedure 

&AtServer
Procedure SyncBase ( Object ) export
	
	if ( syncing ( Object ) ) then
		return;
	endif; 
	updateBase ( Object );
	
EndProcedure 

&AtServer
Procedure updateBase ( Object )
	
	marked = Object.DeletionMark;
	if ( Object.Disconnected ) then
		if ( marked <> Object.PreviousDeletionMark ) then
			raise Output.ChangeDisconnectedDocumentError ();
		endif;
	endif;
	base = Object.Base;
	parent = DF.Values ( base, "Posted, DeletionMark" );
	posted = Object.Posted;
	postingChanged = parent.Posted <> posted;
	markChanged = parent.DeletionMark <> marked;
	if ( postingChanged ) then
		obj = base.GetObject ();
		markSyncing ( obj );
		if ( posted ) then
			if ( obj.CheckFilling () ) then
				obj.Write ( DocumentWriteMode.Posting );
			else
				raise Output.OperationError ();
			endif;
		else
			obj.Write ( DocumentWriteMode.UndoPosting );
		endif; 
	endif;
	if ( markChanged ) then
		obj = base.GetObject ();
		markSyncing ( obj );
		obj.SetDeletionMark ( marked );
	endif;
	
EndProcedure 

&AtClient
Procedure Print ( Params ) export
	
	if ( shortcutPressedInMainWindow ( Params ) ) then
		return;
	endif; 
	form = Params.Source;
	if ( form.Modified ) then
		form.Write ();
	endif; 
	formName = form.FormName;
	if ( formName = "CommonForm.CashReceipt"
		or formName = "CommonForm.CashVoucher" ) then
		document = form.Parameters.Key;
	else
		document = PettyCashSrv.Search ( form.Object.Ref );
	endif; 
	PettyCash.Output ( document );
	
EndProcedure 

&AtClient
Function shortcutPressedInMainWindow ( Params )
	
	return TypeOf ( Params.Source ) = Type ( "ClientApplicationWindow" );
	
EndFunction 

&AtClient
Procedure Output ( Scope ) export
	
	document = ? ( TypeOf ( Scope ) = Type ( "Array" ), Scope [ 0 ], Scope );
	name = ? ( PettyCash.Voucher ( document ), "Voucher", "Receipt" );
	p = Print.GetParams ();
	p.Objects = Scope;
	p.Key = name;
	p.Template = name;
	Print.Print ( p );
	
EndProcedure 

&AtClient
Procedure ClickProcessing ( Form, StandardProcessing ) export
	
	if ( Form.Modified ) then
		StandardProcessing = Form.Write ();
	endif; 
	
EndProcedure
